{
  "backend/main.mo": "Defines core Gita data types, mood enum with ordering, chapter generation, and chatbot response structures.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requests to affected files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Provides short summaries of all frontend files, describing their purpose and behavior for build planning.",
  "frontend/docs/APP_STRUCTURE_AND_FLOWS.md": "Developer documentation detailing app architecture, navigation flows, component responsibilities, and backend API surface.",
  "frontend/index.css": "Global Tailwind-based style definitions with theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app shell handling tab navigation, scroll reset, Krishna background, and global layout with fixed bottom nav.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat input component supporting text and voice input, sending messages, and rotating placeholders.",
  "frontend/src/components/chat/ChatSafetyModal.tsx": "Modal warning users that the chat is not therapy and provides safety guidance.",
  "frontend/src/components/chat/ChatThread.tsx": "Renders a chat conversation with user and Krishna messages, optional verses, and follow-up questions.",
  "frontend/src/components/chat/FollowUpQuestions.tsx": "Displays clickable follow‑up question buttons related to a chat response.",
  "frontend/src/components/chat/MiniAskKrishnaWidget.tsx": "Compact text‑only input widget for submitting a question to Krishna.",
  "frontend/src/components/decorations/FlowerOverlay.tsx": "Empty placeholder file for a decorative flower overlay component.",
  "frontend/src/components/decorations/KrishnaLifeBackground.tsx": "Fixed background component showing layered Krishna life scene images with a gradient overlay.",
  "frontend/src/components/layout/TopMenuBar.tsx": "Top navigation bar with tabs and theme toggle, handling navigation between major views.",
  "frontend/src/components/settings/ThemeToggle.tsx": "Button that switches between light and dark themes using a custom hook.",
  "frontend/src/components/today/TodaysWisdomCard.tsx": "Displays today's selected verse with loading state and navigation back to chapters.",
  "frontend/src/components/verse/VerseCard.tsx": "Card showing verse details including Sanskrit, translations, Gen‑Z interpretation, and an action step.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, including login, logout, and identity state using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch chapters, verses, curated verses, today's verse, and chatbot responses using the backend actor.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements a hook wrapping browser speech recognition to capture live transcripts with start/stop controls.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state synced with localStorage and system preferences with a toggle function.",
  "frontend/src/index.css": "Tailwind base styles plus custom theme variables, dark mode tokens, animations, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Discover/DiscoverPage.tsx": "Renders a mood selection grid and switches to a detailed mood view, enabling navigation to chat based on mood.",
  "frontend/src/pages/Discover/MoodDetailView.tsx": "Shows curated verses for a selected mood with loading states and an option to start a chat.",
  "frontend/src/pages/HomePage.tsx": "Home screen with hero section, Krishna image, mini chat widget, navigation buttons, and social links.",
  "frontend/src/pages/ReadGita/ChapterDetailView.tsx": "Displays chapter details and a scrollable table of verses, loading data via hooks and allowing verse selection.",
  "frontend/src/pages/ReadGita/ChapterListView.tsx": "Shows a searchable list of chapters with loading states and a CTA for Today's Wisdom.",
  "frontend/src/pages/ReadGita/ReadGitaPage.tsx": "Manages navigation between chapter list, chapter detail, verse detail, and today's wisdom views.",
  "frontend/src/pages/ReadGita/VerseDetailView.tsx": "Fetches and displays a single verse with loading fallback and back navigation.",
  "frontend/src/pages/TalkToKrishna/TalkToKrishnaPage.tsx": "Implements a chat interface with Krishna, handling message flow, mood context, API responses, and safety modal.",
  "frontend/src/state/sessionContext.tsx": "Provides session state for mood, message history, and pending messages through React context.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for styling across the app.",
  "project_state.json": "Defines the app’s current project state, including product vision, architectural notes, UI/UX constraints, known issues, required images, and existing feature metadata for the Gita Saar mobile-first app."
}