{
  "backend/main.mo": "Motoko backend defining types and maps for chapters, verses, moods, and chatbot responses, with query methods for verse lookup, mood‑based curation, and daily verse selection.",
  "feature_evidence.json": "Feature evidence record listing a single UI‑text consistency feature tied to ChatThread.tsx with metadata on components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of each major frontend file and component.",
  "frontend/docs/APP_STRUCTURE_AND_FLOWS.md": "Document explaining app architecture, tab flows, core components, and backend API surface.",
  "frontend/docs/DEPLOY_REPORT.md": "Template for recording deployment status, source state, steps, and errors.",
  "frontend/docs/DEPLOY_ROOT_CAUSE.md": "Stub for documenting root‑cause analysis of a deployment failure related to a ThemeProvider import.",
  "frontend/docs/DEPLOY_RUNBOOK.md": "Deployment instructions covering build steps, verification, logging, and troubleshooting.",
  "frontend/index.css": "Tailwind CSS setup defining base styles and light/dark theme design tokens.",
  "frontend/index.html": "Basic HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React shell managing tab navigation, scroll resets, read‑intent logic, background visuals, and bottom navigation bar.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message composer with text and voice input, handling send actions and speech-to-text integration.",
  "frontend/src/components/chat/ChatSafetyModal.tsx": "Modal displaying safety disclaimers about non-medical nature of the chat experience.",
  "frontend/src/components/chat/ChatThread.tsx": "Renders chat messages with support for verses, action steps, and follow‑up questions.",
  "frontend/src/components/chat/FollowUpQuestions.tsx": "Displays clickable follow‑up question buttons for additional guidance.",
  "frontend/src/components/chat/HomeAskKrishnaChat.tsx": "Main chat container managing messages, API calls, error handling, and UI expansion logic.",
  "frontend/src/components/chat/MiniAskKrishnaWidget.tsx": "Compact input widget for sending quick questions to the chat system.",
  "frontend/src/components/common/QueryErrorState.tsx": "Reusable error alert with retry functionality for failed queries.",
  "frontend/src/components/common/SafeImage.tsx": "Image component that swaps to fallback or placeholder on load failure.",
  "frontend/src/components/decorations/FlowerOverlay.tsx": "Placeholder decorative component currently rendering nothing.",
  "frontend/src/components/decorations/KrishnaLifeBackground.tsx": "Fixed background layer showing faint Krishna‑themed scenes with a readability overlay.",
  "frontend/src/components/layout/TopMenuBar.tsx": "Top navigation bar controlling tab navigation and theme toggle placement.",
  "frontend/src/components/settings/ThemeToggle.tsx": "Button toggling between light and dark themes.",
  "frontend/src/components/today/TodaysWisdomCard.tsx": "Fetches and displays today's verse with loading, error, and fallback states.",
  "frontend/src/components/verse/VerseCard.tsx": "Displays a verse card with collapsible Sanskrit, English translation, Gen-Z interpretation, and action step sections.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and client creation.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for chapters, verses, curated content, and chatbot responses.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements speech-to-text using browser recognition APIs with start/stop controls and graceful fallback.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state synced with localStorage and system preferences.",
  "frontend/src/index.css": "Defines Tailwind setup, theme variables, dark mode styles, utilities, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Discover/DiscoverPage.tsx": "Renders a mood selection page with cards and a detail view, enabling navigation to chat based on mood.",
  "frontend/src/pages/Discover/MoodDetailView.tsx": "Displays curated verses for a selected mood with loading states and a button to start a chat.",
  "frontend/src/pages/HomePage.tsx": "Renders the main home screen with Krishna chat, hero section, and navigation to reading or discovering content.",
  "frontend/src/pages/ReadGita/ChapterDetailView.tsx": "Shows detailed verse table for a chapter with loading, error handling, and verse selection.",
  "frontend/src/pages/ReadGita/ChapterListView.tsx": "Lists all chapters with search, loading, and error states, allowing navigation to chapter details or today’s wisdom.",
  "frontend/src/pages/ReadGita/ReadGitaPage.tsx": "Controls navigation between chapter list, today’s wisdom, chapter details, and verse details.",
  "frontend/src/pages/ReadGita/VerseDetailView.tsx": "Loads and displays an individual verse with error and loading states and a back action.",
  "frontend/src/pages/TalkToKrishna/TalkToKrishnaPage.tsx": "Implements the Krishna chat experience with message history, chatbot responses, and safety modal handling.",
  "frontend/src/state/sessionContext.tsx": "Provides a React context managing mood, chat history, pending messages, and read-Gita intents with helper setters and consumers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, current issues, features, and build/deploy status for coordinating fixes and development tasks."
}