{
  "backend/main.mo": "Defines data types and provides query methods for chapters, verses, and mood-based verse retrieval.",
  "feature_evidence.json": "Lists feature evidence entries mapping requested UX updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Aggregated textual summaries of key frontend files and their roles in layout, navigation, and component behavior.",
  "frontend/docs/APP_STRUCTURE_AND_FLOWS.md": "Developer documentation outlining app architecture, flows, components, and backend API surface.",
  "frontend/index.css": "Global Tailwind-based theme variables and base styles for light and dark mode.",
  "frontend/index.html": "Root HTML template mounting the React app.",
  "frontend/src/App.tsx": "Main application shell handling tab navigation, global top menu bar, and scroll‑to‑top behavior.",
  "frontend/src/components/chat/ChatComposer.tsx": "Text and voice chat composer with speech-to-text, sending messages, and dynamic placeholders.",
  "frontend/src/components/chat/ChatSafetyModal.tsx": "Modal explaining chat limitations and safety guidance for users.",
  "frontend/src/components/chat/ChatThread.tsx": "Renders chat messages with support for verses and follow-up questions.",
  "frontend/src/components/chat/FollowUpQuestions.tsx": "Displays follow-up question buttons for user interaction.",
  "frontend/src/components/layout/TopMenuBar.tsx": "Top navigation bar with tab switching and theme toggle.",
  "frontend/src/components/settings/ThemeToggle.tsx": "Button to switch between light and dark themes.",
  "frontend/src/components/today/TodaysWisdomCard.tsx": "Fetches and displays the daily verse with loading and fallback states.",
  "frontend/src/components/verse/VerseCard.tsx": "Shows a verse with translations, Sanskrit toggle, interpretation, and action step.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors via React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, and logout via context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for chapters, verses, moods, and chatbot responses.",
  "frontend/src/hooks/useSpeechToText.ts": "Provides a hook for browser speech recognition with start/stop controls and a transcript state.",
  "frontend/src/hooks/useTheme.ts": "Handles light/dark theme state, syncing with localStorage and applying classes to the document root.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables for light/dark modes, and custom utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Discover/DiscoverPage.tsx": "Shows mood cards and routes to a detailed mood view or chat based on selection.",
  "frontend/src/pages/Discover/MoodDetailView.tsx": "Displays curated verses for a selected mood with loading states and a CTA to start a chat.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with hero content, CTAs, decorative assets, and navigation options.",
  "frontend/src/pages/ReadGita/ChapterDetailView.tsx": "Loads and shows a chapter’s verses in a table with navigation back and verse selection.",
  "frontend/src/pages/ReadGita/ChapterListView.tsx": "Lists all chapters with search, loading skeletons, and navigation to chapter detail.",
  "frontend/src/pages/ReadGita/ReadGitaPage.tsx": "Controls navigation between chapter list, today's wisdom, chapter detail, and verse detail views for the Read Gita section.",
  "frontend/src/pages/ReadGita/VerseDetailView.tsx": "Fetches and displays a single verse with loading and error states, including a back button.",
  "frontend/src/pages/TalkToKrishna/TalkToKrishnaPage.tsx": "Implements the chatbot UI, handling message flow, mood display, safety modal, and sending user input to the backend.",
  "frontend/src/state/sessionContext.tsx": "Provides session-level state for mood and chat history with helpers to update and reset them.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, animations, and plugin usage for the frontend.",
  "project_state.json": "Defines overall project metadata, requirements, constraints, design rules, and known issues for Gita Saar."
}