{
  "backend/main.mo": "Defines Gita data types, mood logic, and functions to generate chapters and support chatbot responses. Provides backend API structures for chapters, verses, moods, and chat interactions.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files describing their purpose, UI behavior, and architectural roles.",
  "frontend/docs/APP_STRUCTURE_AND_FLOWS.md": "Documentation outlining app architecture, tab flows, state management, page behaviors, and backend API surface.",
  "frontend/index.css": "Tailwind base configuration defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level app shell handling tab navigation, scroll reset, theme/session providers, and layout structure.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat composer with text and voice input handling, rotating placeholders, and send logic integrated with speech-to-text.",
  "frontend/src/components/chat/ChatSafetyModal.tsx": "Displays a modal with safety disclaimers clarifying the chat is not therapy or medical advice.",
  "frontend/src/components/chat/ChatThread.tsx": "Renders a list of chat messages with support for verses, follow‑up questions, and different layouts for user and Krishna messages.",
  "frontend/src/components/chat/FollowUpQuestions.tsx": "Shows a list of follow‑up question buttons and triggers a callback when one is clicked.",
  "frontend/src/components/chat/MiniAskKrishnaWidget.tsx": "Provides a compact text input and send button for submitting questions to Krishna.",
  "frontend/src/components/common/QueryErrorState.tsx": "Displays an error alert with a retry button for failed queries.",
  "frontend/src/components/common/SafeImage.tsx": "Renders an image with fallback handling and a placeholder if loading fails.",
  "frontend/src/components/decorations/FlowerOverlay.tsx": "Placeholder decoration component that currently renders nothing.",
  "frontend/src/components/decorations/KrishnaLifeBackground.tsx": "Provides a fixed decorative background with multiple low‑opacity Krishna life scene images and a readability gradient.",
  "frontend/src/components/layout/TopMenuBar.tsx": "Renders the top navigation bar with tab buttons and a theme toggle, including scroll‑to‑top behavior on home.",
  "frontend/src/components/settings/ThemeToggle.tsx": "Button that switches between light and dark themes using the useTheme hook.",
  "frontend/src/components/today/TodaysWisdomCard.tsx": "Loads and displays today's Gita verse with loading, error, and retry states.",
  "frontend/src/components/verse/VerseCard.tsx": "Displays a verse with collapsible Sanskrit and English sections, Gen Z interpretation, and an action step.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching chapters, verses, curated verses, and chatbot responses through the backend actor.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements speech‑to‑text using the browser’s SpeechRecognition API with start/stop controls and transcript state.",
  "frontend/src/hooks/useTheme.ts": "Provides light/dark theme state synced with localStorage and system preference, plus a toggle function.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark design tokens, animations, utilities, and global styling.",
  "frontend/src/main.tsx": "App entry point that mounts React, wrapping the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Discover/DiscoverPage.tsx": "Renders the Discover page showing mood cards and navigates to mood‑specific detail views or chat sessions.",
  "frontend/src/pages/Discover/MoodDetailView.tsx": "Displays curated verses for a selected mood with loading skeletons and a call‑to‑action to start a chat.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero content, mini chat widget, navigation actions, and branding elements.",
  "frontend/src/pages/ReadGita/ChapterDetailView.tsx": "Displays a chapter’s metadata and a table of verses, handling loading and error states and allowing verse selection or navigation back.",
  "frontend/src/pages/ReadGita/ChapterListView.tsx": "Shows a searchable list of Gita chapters with loading/error handling and allows selecting a chapter or viewing today's wisdom.",
  "frontend/src/pages/ReadGita/ReadGitaPage.tsx": "Manages navigation between chapter list, chapter detail, verse detail, and today's wisdom views using internal state and session intents.",
  "frontend/src/pages/ReadGita/VerseDetailView.tsx": "Loads and displays a single verse with error and loading states and includes navigation back to the chapter.",
  "frontend/src/pages/TalkToKrishna/TalkToKrishnaPage.tsx": "Implements the chat interface with Krishna, managing messages, mood context, pending messages, and invoking the chatbot API.",
  "frontend/src/state/sessionContext.tsx": "Provides global session state for mood, chat history, pending messages, and navigation intents with helper methods to update and consume them.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin usage for styling across the app.",
  "project_state.json": "Stores project state including known issues, existing features, and a new backend-hardening request related to Read Gita errors."
}