{
  "backend/main.mo": "Defines core Gita data types, mood comparison logic, and functions generating chapter lists and supporting chatbot and verse retrieval.",
  "feature_evidence.json": "Lists feature evidence entries linking UI changes to affected frontend files and associated components with high confidence.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries of key frontend files for quick reference during build planning.",
  "frontend/docs/APP_STRUCTURE_AND_FLOWS.md": "Documentation outlining app architecture, navigation flows, backend API surface, and major component responsibilities.",
  "frontend/index.css": "Defines global Tailwind layers, color variables for light/dark themes, and base styling for the app.",
  "frontend/index.html": "Minimal HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main application shell handling tab navigation, scroll resets, theme and session providers, and fixed bottom navigation.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat composer with text and voice input, rotating placeholders, Enter-to-send logic, and speech-to-text integration.",
  "frontend/src/components/chat/ChatSafetyModal.tsx": "Modal warning users that the chat offers reflection, not therapy, with disclaimers and guidance.",
  "frontend/src/components/chat/ChatThread.tsx": "Renders chat messages with support for verses, follow-up questions, and user/assistant styling.",
  "frontend/src/components/chat/FollowUpQuestions.tsx": "Displays suggested follow‑up question buttons that trigger a callback when clicked.",
  "frontend/src/components/chat/MiniAskKrishnaWidget.tsx": "Small input widget allowing users to submit short questions via textarea and send button.",
  "frontend/src/components/decorations/FlowerOverlay.tsx": "Empty placeholder component for decorative overlay.",
  "frontend/src/components/decorations/KrishnaLifeBackground.tsx": "Fixed background layering multiple Krishna‑themed images with a readability gradient.",
  "frontend/src/components/layout/TopMenuBar.tsx": "Top navigation bar with tabs for main sections and a theme toggle.",
  "frontend/src/components/settings/ThemeToggle.tsx": "Button that switches between light and dark themes using useTheme.",
  "frontend/src/components/today/TodaysWisdomCard.tsx": "Displays today’s verse with loading skeleton and a back button.",
  "frontend/src/components/verse/VerseCard.tsx": "Card showing verse details, translations, interpretation, Sanskrit toggle, and action step.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identity, and status.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching chapters, verses, curated content, and chatbot responses via the actor.",
  "frontend/src/hooks/useSpeechToText.ts": "Provides a hook that manages browser speech recognition, tracking listening state and transcripts.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and DOM class updates.",
  "frontend/src/index.css": "Defines Tailwind layers, custom CSS variables, themes, and utility animations for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Discover/DiscoverPage.tsx": "Displays a grid of moods and shows detailed mood content, enabling navigation to chat.",
  "frontend/src/pages/Discover/MoodDetailView.tsx": "Shows curated verses for a selected mood with loading states and a chat CTA.",
  "frontend/src/pages/HomePage.tsx": "Home screen with hero content, mini chat widget, Krishna portrait, and navigation CTAs.",
  "frontend/src/pages/ReadGita/ChapterDetailView.tsx": "Renders chapter details and a scrollable verse table with selectable verses.",
  "frontend/src/pages/ReadGita/ChapterListView.tsx": "Lists all chapters with search filtering and a CTA for today's wisdom.",
  "frontend/src/pages/ReadGita/ReadGitaPage.tsx": "Controls navigation between chapter list, today's wisdom, chapter details, and verse details using state and callbacks.",
  "frontend/src/pages/ReadGita/VerseDetailView.tsx": "Fetches and displays a single verse with loading and error states, including a back button.",
  "frontend/src/pages/TalkToKrishna/TalkToKrishnaPage.tsx": "Implements chat UI for interacting with Krishna, sending messages, receiving bot responses, and managing mood and session history.",
  "frontend/src/state/sessionContext.tsx": "Provides context for mood, chat history, and pending messages with helpers to update and reset session state.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, custom colors, animations, container settings, and plugin usage.",
  "project_state.json": "Holds project metadata and feature requests focused on removing Hindi translation while keeping Gen Z interpretations in the UI."
}