{
  "backend/main.mo": "Motoko actor defining chapters, verses, moods, and query APIs for retrieving Gita data and mood‑based verse suggestions.",
  "backend/migration.mo": "Migration module converting old chapter data to the new chapter structure with summary and keyInsights fields.",
  "feature_evidence.json": "Feature evidence report listing UI/UX features, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Human‑written summaries describing the purpose of each frontend file related to UI, pages, components, and hooks.",
  "frontend/docs/APP_STRUCTURE_AND_FLOWS.md": "Documentation outlining app architecture, navigation flows, component roles, and backend API surface.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions establishing the pink background and purple accent system.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main React app shell implementing tab navigation, scroll restoration, theming, and page routing.",
  "frontend/src/components/chat/ChatComposer.tsx": "Text and voice message composer with speech-to-text integration and send controls.",
  "frontend/src/components/chat/ChatSafetyModal.tsx": "Modal warning users that the chat is not therapy and offering safety guidance.",
  "frontend/src/components/chat/ChatThread.tsx": "Renders chat messages with support for verses and follow‑up questions.",
  "frontend/src/components/chat/FollowUpQuestions.tsx": "Shows suggested follow‑up questions as clickable buttons.",
  "frontend/src/components/settings/ThemeToggle.tsx": "Toggles between light and dark UI themes.",
  "frontend/src/components/today/TodaysWisdomCard.tsx": "Displays today’s verse or a loading/empty state with a back button.",
  "frontend/src/components/verse/VerseCard.tsx": "Expandable verse card showing Sanskrit, translations, interpretation, and an action step.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides login, identity state, and management using Internet Identity and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching chapters, verses, curated content, and chatbot responses from the backend.",
  "frontend/src/hooks/useSpeechToText.ts": "Browser speech‑to‑text hook handling recognition lifecycle and transcript updates.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme with localStorage persistence and DOM updates.",
  "frontend/src/index.css": "Sets up Tailwind layers, defines light/dark theme CSS variables, global styles, and custom animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Discover/DiscoverPage.tsx": "Displays mood options and navigates to detailed mood views or chat based on user selection.",
  "frontend/src/pages/Discover/MoodDetailView.tsx": "Shows curated verses for a selected mood with loading states and an option to start a chat.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, navigation buttons, theme toggle, and feature cards.",
  "frontend/src/pages/ReadGita/ChapterDetailView.tsx": "Loads and displays chapter metadata and its verses with skeletons during fetch.",
  "frontend/src/pages/ReadGita/ChapterListView.tsx": "Lists all chapters with search filtering, a 'Today’s Wisdom' button, and loading placeholders.",
  "frontend/src/pages/ReadGita/ReadGitaPage.tsx": "Manages navigation between chapter list, chapter detail, verse detail, and today's wisdom views.",
  "frontend/src/pages/ReadGita/VerseDetailView.tsx": "Fetches and displays a single verse with a back button and loading skeleton.",
  "frontend/src/pages/TalkToKrishna/TalkToKrishnaPage.tsx": "Implements the Krishna chat page with mood-aware messaging, session history, chatbot responses, and UI for thread display and safety modal.",
  "frontend/src/state/sessionContext.tsx": "Provides React context for storing mood and session message history with setters and reset utilities.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugin integrations for the app’s design system.",
  "project_state.json": "Describes the project’s overall goals, constraints, architecture notes, existing features, and design rules for the Gita Saar app."
}