{
  "backend/main.mo": "Defines data types for chapters, verses, moods, and chatbot responses, and initializes a map of verses for Bhagavad Gita Chapter 1. Includes helper functions and storage maps for verse lookup.",
  "feature_evidence.json": "Empty feature evidence report JSON structure with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend source files, describing their roles and behaviors in the app.",
  "frontend/docs/APP_STRUCTURE_AND_FLOWS.md": "Documentation outlining app architecture, navigation flows, key components, and backend API surface.",
  "frontend/docs/DEPLOY_REPORT.md": "Template for recording details and outcomes of deployment attempts.",
  "frontend/docs/DEPLOY_ROOT_CAUSE.md": "Template for documenting root-cause analysis of deployment failures.",
  "frontend/docs/DEPLOY_RUNBOOK.md": "Deployment guide detailing prerequisites, build steps, verification, and troubleshooting procedures.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and global styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component managing tab navigation, scroll resets, session context, and layout structure.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat composer with text input, keyboard send, placeholder rotation, and optional speech-to-text voice input.",
  "frontend/src/components/chat/ChatSafetyModal.tsx": "A modal dialog explaining safety disclaimers about the chat not being medical or therapeutic advice.",
  "frontend/src/components/chat/ChatThread.tsx": "Renders a sequence of chat messages with optional verse cards, action steps, and follow‑up questions.",
  "frontend/src/components/chat/FollowUpQuestions.tsx": "Displays suggested follow‑up question buttons that trigger a callback when clicked.",
  "frontend/src/components/chat/HomeAskKrishnaChat.tsx": "Main chat interface handling message flow, API responses, history, errors, and safety modal logic.",
  "frontend/src/components/chat/MiniAskKrishnaWidget.tsx": "Compact input widget allowing users to submit a quick message to Krishna.",
  "frontend/src/components/common/QueryErrorState.tsx": "Shows an error alert with a retry button for failed data queries.",
  "frontend/src/components/common/SafeImage.tsx": "Image component that swaps to a fallback or placeholder if the primary source fails to load.",
  "frontend/src/components/decorations/FlowerOverlay.tsx": "Placeholder decoration component that currently renders nothing.",
  "frontend/src/components/decorations/KrishnaLifeBackground.tsx": "Displays layered Krishna‑themed background images with a readability gradient overlay.",
  "frontend/src/components/layout/TopMenuBar.tsx": "Top navigation bar enabling tab switching and scroll‑to‑top behavior on Home.",
  "frontend/src/components/settings/ThemeToggle.tsx": "Button that toggles between light and dark themes.",
  "frontend/src/components/today/TodaysWisdomCard.tsx": "Fetches and displays today's verse with loading, error, and retry states.",
  "frontend/src/components/verse/VerseCard.tsx": "Displays a verse card with collapsible Sanskrit, English translation, Gen-Z interpretation, and an action step.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refetching related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching chapters, verses, moods, and chatbot responses through the backend actor.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements speech-to-text using browser APIs with start/stop controls and transcript state.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and DOM updates.",
  "frontend/src/index.css": "Tailwind setup with theme variables, dark mode settings, utilities, and animations.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/Discover/DiscoverPage.tsx": "Renders a mood selection grid and transitions to a detail view or chat based on user mood selection.",
  "frontend/src/pages/Discover/MoodDetailView.tsx": "Displays mood-specific curated verses with loading states and actions to go back or start a Krishna chat.",
  "frontend/src/pages/HomePage.tsx": "Home screen showing Krishna chat widget, hero content, and navigation buttons for wisdom, reading, chat, and discovery.",
  "frontend/src/pages/ReadGita/ChapterDetailView.tsx": "Shows detailed list of verses for a chapter with table layout, loading/error states, and verse selection handling.",
  "frontend/src/pages/ReadGita/ChapterListView.tsx": "Lists all chapters with search, loading/error states, and actions to view a chapter or today's wisdom.",
  "frontend/src/pages/ReadGita/ReadGitaPage.tsx": "Controls navigation between chapter list, today's wisdom, chapter detail, and verse detail views based on user actions and session intent.",
  "frontend/src/pages/ReadGita/VerseDetailView.tsx": "Displays a single verse with loading/error handling and a back action to return to the chapter view.",
  "frontend/src/pages/TalkToKrishna/TalkToKrishnaPage.tsx": "Implements chat with Krishna, managing messages, pending prompts, API responses, and follow-up interactions.",
  "frontend/src/state/sessionContext.tsx": "Provides a React context storing mood, chat history, pending messages, and read‑Gita intents, with helpers to update and consume these values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, shadows, and container settings using plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current state, including update summary, architectural notes, known issues, and existing feature definitions."
}