{
  "kind": "build_request",
  "title": "Refine Home hero layout, global top menu bar, scroll-to-top navigation, and Read Gita chapter list formatting",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Update the Home page hero layout so that “Open today’s wisdom” and “Find by mood” render side-by-side (parallel) directly under the hero subtext (“The Bhagavad Gita — decoded for overthinkers, anxious minds, and curious Gen-Z souls.”) and are visible without scrolling on typical mobile viewports.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make home page such that Open today's wisdom and Find by mood come parallel just under The Bhagavad Gita — decoded for overthinkers, anxious minds, and curious Gen-Z souls. and are visible on the home page (move fonts for all content such that these are visible)."
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, the two CTAs “Open today’s wisdom” and “Find by mood” appear in a single row on mobile (wrapping only on extremely narrow widths), positioned immediately below the hero subtext.",
        "On initial load at ~390x844 viewport, both CTAs are visible without scrolling (no vertical overflow required to see them).",
        "The CTA buttons remain tappable and maintain the existing app styling (rounded/pill, soft pastel, readable in light/dark)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Update the Home page hero layout so that the “Talk to Krishna” CTA is moved next to the Lord Krishna picture (portrait) rather than being stacked below the “Find by mood” button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make the home page such that Talk to krishna (below find my mood) moves next to krishna's pic."
        ]
      },
      "acceptanceCriteria": [
        "On the Home page hero, the “Talk to Krishna” button is visually grouped with and placed adjacent to the Krishna portrait (e.g., beside it or aligned in the same row/cluster), not underneath the other two CTAs.",
        "The button continues to navigate to the Talk to Krishna tab when clicked.",
        "Layout remains responsive and does not overlap the portrait on small screens."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Make the floral visuals in the Home page background more prominent while preserving readability of foreground hero text and CTAs in both light and dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Create more prominent flowers in the background of the home page."
        ]
      },
      "acceptanceCriteria": [
        "The Home page floral decoration is noticeably more visible than the current implementation (e.g., increased scale/coverage/contrast/opacity and/or additional placements), but hero headline/subtext and CTA labels retain accessible contrast.",
        "No foreground UI elements become visually cluttered or hard to read in either light or dark theme."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Make the top menu bar (buttons labeled exactly: “Home”, “Read Gita”, “Discover”, “Ask Krishna”) visible on all pages/tabs (Home, Read Gita, Discover, Talk to Krishna), not only on the Home page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The meny bar should be visible on all pages."
        ]
      },
      "acceptanceCriteria": [
        "When switching to any tab (Read Gita, Discover, Talk to Krishna), the same top menu bar is present and sticky at the top.",
        "Menu button labels match exactly: “Home”, “Read Gita”, “Discover”, “Ask Krishna”.",
        "Clicking “Read Gita”, “Discover”, and “Ask Krishna” navigates to the corresponding existing tabs.",
        "Clicking “Home” returns to Home tab if not already there; if already on Home tab it scrolls the Home content to the top."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Change navigation scroll behavior so that when a user opens any tab/page, it starts at the top of that page (do not preserve previous per-tab scroll position). Also ensure internal view changes within Read Gita (chapter list → chapter detail → verse detail → back) start at the top of the newly shown view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "All pages when opened should open on the top of the page."
        ]
      },
      "acceptanceCriteria": [
        "Switching tabs always scrolls to the top (window scrollY becomes 0) immediately on tab activation.",
        "In Read Gita, when switching between views (chapters/today/chapter-detail/verse-detail), the view opens scrolled to the top of its content.",
        "This behavior is consistent across Home, Read Gita, Discover, and Talk to Krishna."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Ensure the Read Gita chapter list displays all 18 chapters and show each chapter’s total verse count in brackets in the list UI (e.g., “(47)”).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The read gita should have all chapters listed (all 18 with total verses numbers in brackets each individually for them)"
        ]
      },
      "acceptanceCriteria": [
        "The chapter listing renders 18 chapters when backend data is available (no missing entries).",
        "Each chapter card displays the verse count in bracket format (example: “(47)”) in addition to the chapter title/subtitle.",
        "The search filter still works and only filters from the full set of 18 chapters."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn components must be composed, not edited).",
    "Do not edit immutable hook/provider paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Respect the existing four-tab app structure (Home, Read Gita, Talk to Krishna, Discover); do not add new tabs.",
    "Keep the app 100% free: do not add paywalls, subscriptions, upsells, or guilt nudges."
  ],
  "nonGoals": [
    "Do not change backend chapter/verse data models or APIs as part of this request.",
    "Do not redesign the bottom navigation; keep it functional as-is.",
    "Do not change chatbot behavior/personality rules."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Increase visibility and prominence of the floral decoration while keeping a soft pastel style (flowers-corner.dim_1024x1024.png > flowers-corner-prominent.dim_1024x1024.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}