{
  "kind": "build_request",
  "title": "Read Gita: Expand table rows to show full cell content and populate complete verse dataset",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Read Gita chapter verse table so each row expands vertically to display the full content of every cell across all 5 columns (no truncation/ellipsis) on both desktop and mobile layouts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Increase the row depth to include all content in the cells of the table for all 5 columns."
        ]
      },
      "acceptanceCriteria": [
        "In ChapterDetailView, none of the 5 table columns use line-clamping or other truncation; long text wraps and the row height increases to fit it.",
        "Desktop table rows show full Sanskrit, Literal English, Gen-Z Interpretation, and Action Step text without ellipses.",
        "Mobile table rows (the horizontal-scroll table) also show full text for all columns without ellipses, with rows expanding in height as needed.",
        "The table remains readable and aligned (cell content top-aligned) for multi-line content."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Populate backend verse data so the app contains verse records for every verse in every chapter (all 18 chapters), and ensure chapter verse counts match the returned verse list sizes.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Also poulate all the data for all verses for all chapters"
        ]
      },
      "acceptanceCriteria": [
        "For each chapter 1–18, getVersesByChapter(chapterNumber) returns exactly the number of verses specified by that chapter’s verseCount.",
        "For any valid (chapter, verse) pair within the chapter’s verseCount, getVerse(chapter, verse) returns a non-null Verse with non-empty text fields for the 5-column table content (at minimum: sanskrit, englishMeaning, genZKrishnaInterpretation, actionStep).",
        "The Read Gita UI no longer shows \"No verses available for this chapter yet.\" for any chapter 1–18.",
        "Curated verse lookups by mood do not reference missing verses (i.e., getCuratedVersesByMood returns only verses that exist in the full dataset)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui (they are immutable); compose styling changes within app/page components such as frontend/src/pages/ReadGita/ChapterDetailView.tsx."
  ],
  "nonGoals": [
    "Do not change the overall Read Gita navigation flow (chapter list → chapter detail → verse detail).",
    "Do not add new authentication methods or external databases/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}