{
  "kind": "build_request",
  "title": "Make Ask Krishna static, switch Read Gita to 5-column verse table, replace floral overlays with Krishna-life background imagery, and populate all verses",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Make the “Ask Krishna” entry UI static (not moving with scroll) by ensuring the Home page’s mini Ask Krishna widget section remains fixed/sticky below the global TopMenuBar across Home scrolling, and ensure the chat composer on the Talk to Krishna page remains fixed at the bottom while the chat thread scrolls independently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make ask krishna static and not moving with scroll."
        ]
      },
      "acceptanceCriteria": [
        "On the Home tab, the Krishna portrait + mini Ask Krishna widget stays visible and does not scroll away while the user scrolls the rest of the Home content.",
        "On the Talk to Krishna tab, the message composer stays visible at the bottom while only the message list scrolls.",
        "No UI overlap occurs between the TopMenuBar and the sticky Ask Krishna section (correct top offset is preserved)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Update the Read Gita chapter detail verse table to a 5-column layout exactly as follows: (1) Chapter:Verse identifier, (2) Original Sanskrit verse (full text), (3) Literal Hindi meaning, (4) Literal English meaning, (5) Interpretation in elegant, respectable Gen-Z lingo. Apply this consistently for every chapter’s verse listing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "In read gita section, verses should be given in 5 columns - column 1 mentions chapter and verse number, column 2 provides the original verse in sanskrit, column 3 mentions literal meaning of the verse in Hindi, column 4 mentions literal meaning of the verse in English, column 5 mentions interpretation of the verse in very elegant and respectable Gen Z lingo."
        ]
      },
      "acceptanceCriteria": [
        "In ChapterDetailView, the table header shows 5 columns corresponding to: Chapter:Verse, Sanskrit, Literal Hindi, Literal English, Interpretation.",
        "Each verse row renders the Chapter:Verse identifier (e.g., “2:47”) in column 1, and the full Sanskrit shloka in column 2 (not just a preview).",
        "Horizontal scrolling still works on mobile and all 5 columns remain accessible and readable."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Replace the current floral overlay/background decorations with Krishna-life background imagery used across the app. Remove the flower overlay from the global app shell and instead render a subtle, readable background treatment composed of Lord Krishna images from various instances in his life, ensuring readability in both light and dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also study krishna's ;ife and rather than flowers in the background for the whole have Krishna's pics from various instances in his life as background pics."
        ]
      },
      "acceptanceCriteria": [
        "The FlowerOverlay is no longer rendered globally (no flower stickers appear anywhere unless explicitly reintroduced).",
        "The app uses Krishna-life imagery as background visuals across tabs (Home, Read Gita, Discover, Talk to Krishna) with appropriate opacity/blur so foreground text and cards remain readable.",
        "Light and dark mode both maintain sufficient contrast (no background image makes primary text or table content hard to read).",
        "All newly generated images are served as static assets from frontend/public/assets/generated and referenced directly from the frontend."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Populate the backend with the complete set of verses for all 18 chapters so that Read Gita can display every verse in the 5-column format fields (chapter, verse, Sanskrit, literal Hindi, literal English, elegant/respectable Gen-Z interpretation). Ensure the existing backend query methods return complete data for every chapter and verse.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Then populate all verses for all chapters in 5 columns as envisaged"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo `getVersesByChapter(chapterNumber)` returns all verses for the requested chapter (not a partial/sample list).",
        "backend/main.mo `getVerse(chapter, verse)` returns the correct verse for any valid chapter/verse reference across the entire Bhagavad Gita.",
        "Every returned Verse includes: `sanskrit`, `hindiMeaning` (literal), `englishMeaning` (literal), and `genZKrishnaInterpretation` written in an elegant/respectful Gen-Z tone.",
        "Existing Verse fields required elsewhere in the app (including `actionStep`) remain present and non-empty so VerseDetailView and chat verse rendering continue to work."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; add backend/migration.mo only if an upgrade requires state migration.",
    "Do not modify any frontend files under immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "All newly generated image assets must be added under frontend/public/assets/generated and referenced directly from the frontend (do not serve images via the backend).",
    "Do not add paywalls, subscriptions, upsells, or monetization UI.",
    "Maintain existing AI safety boundaries and the “not therapy/medical advice” messaging."
  ],
  "nonGoals": [
    "Do not change the app’s four-tab structure (Home, Read Gita, Discover, Ask Krishna/Talk to Krishna).",
    "Do not introduce third-party authentication beyond Internet Identity.",
    "Do not add real-time features (WebSockets) or external databases/services."
  ],
  "imageRequirements": {
    "required": [
      "Krishna-life background image: baby Krishna with butter theme, soft pastel style (krishna-life-bg-1.dim_1600x2400.png)",
      "Krishna-life background image: Krishna playing flute, serene devotional style (krishna-life-bg-2.dim_1600x2400.png)",
      "Krishna-life background image: Krishna lifting Govardhan, gentle pastel illustration/photo-collage look (krishna-life-bg-3.dim_1600x2400.png)",
      "Krishna-life background image: Krishna with Arjuna on chariot (Kurukshetra), subtle and non-busy composition (krishna-life-bg-4.dim_1600x2400.png)",
      "Krishna-life background image: Krishna dancing on Kaliya, softened tones and low visual noise (krishna-life-bg-5.dim_1600x2400.png)",
      "Krishna-life background image: Radha-Krishna devotional scene, minimal background clutter (krishna-life-bg-6.dim_1600x2400.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Prefer Krishna-life imagery as background visuals across the app instead of floral decorations.",
      "Read Gita verse tables should use a 5-column layout including Chapter:Verse and full Sanskrit as separate columns."
    ],
    "preferencesToRemove": [
      "Use flower overlays as the primary global decorative background."
    ],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}