{
  "kind": "build_request",
  "title": "Fix error message in Read Gita section",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Identify and fix the underlying cause of the error shown in the Read Gita section so that chapters and verses load reliably without triggering a runtime exception or failed backend call.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am getting error message in read gita section. fix this"
        ]
      },
      "acceptanceCriteria": [
        "Opening the Read Gita tab loads the chapter list without showing an error message.",
        "Selecting a chapter successfully loads that chapter’s verse list without errors.",
        "No uncaught exceptions occur in the browser console during Read Gita navigation (chapter list -> chapter detail -> verse detail -> back)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add consistent user-facing error handling and recovery actions to the Read Gita views (ChapterDetailView, VerseDetailView, and Today’s Wisdom view), including displaying a clear English error state and a Retry action when their respective queries fail.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am getting error message in read gita section. fix this"
        ]
      },
      "acceptanceCriteria": [
        "If loading verses for a chapter fails, the chapter detail screen shows an English error message and a Retry button that re-attempts the request.",
        "If loading an individual verse fails, the verse detail screen shows an English error message and a Retry button.",
        "If loading Today’s Wisdom fails, the Today’s Wisdom screen shows an English error message and a Retry button.",
        "Existing non-error empty states remain intact (e.g., “No verses available for this chapter yet.” when the backend returns an empty list)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Harden the backend Read Gita query methods so they cannot trap on missing data and always return the expected types for: getAllChapters, getVersesByChapter, getVerse, and getTodaysVerse.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am getting error message in read gita section. fix this"
        ]
      },
      "acceptanceCriteria": [
        "Backend canister compiles and deploys successfully after changes.",
        "Calling getAllChapters returns a non-empty list of chapters.",
        "Calling getVersesByChapter for any chapter returns an array (possibly empty) without trapping.",
        "Calling getVerse for a missing verse returns null (Motoko ?Verse) without trapping.",
        "Calling getTodaysVerse always returns a Verse without trapping."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if an actual state migration is required."
  ],
  "nonGoals": [
    "Adding new Gita content, new chapters, or additional verses beyond what is needed to fix the error.",
    "Redesigning the overall app navigation or adding new tabs/features unrelated to Read Gita."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}