{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Hindi translation from Read Gita tables and verse detail UI while keeping Gen Z interpretation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the Read Gita chapter verses table to remove the Hindi translation column while keeping the Gen Z interpretation column and ensuring table layout remains correct.",
      "acceptanceCriteria": [
        "In `frontend/src/pages/ReadGita/ChapterDetailView.tsx`, the table header no longer includes a Hindi translation column (e.g., remove \"Literal Hindi\").",
        "Each verse row no longer renders `verse.hindiMeaning` in the chapter table.",
        "The remaining columns include: Ch:Verse, Sanskrit, Literal English, and Interpretation (Gen-Z).",
        "The table empty-state `colSpan` value matches the new total number of columns.",
        "Any hardcoded layout values tied to the old column count (e.g., skeleton row count, min table width) are updated so the table renders correctly on desktop and mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ReadGita/ChapterDetailView.tsx",
          "operation": "modify",
          "description": "Remove the Hindi translation column from the chapter verses table by deleting the \"Literal Hindi\" header and the corresponding body cell that renders verse.hindiMeaning, while retaining the Interpretation (Gen-Z) column. Update table-level layout constants tied to the old 5-column layout (e.g., comment labeling, empty-state TableCell colSpan from 5 to 4, and any hardcoded min table width) so rendering remains correct on desktop and mobile. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the Hindi translation section from the single-verse detail card while keeping Sanskrit, Literal English, Gen Z interpretation, and Action Step sections responsive.",
      "acceptanceCriteria": [
        "In `frontend/src/components/verse/VerseCard.tsx`, remove the \"Literal Hindi Translation\" section and stop rendering `verse.hindiMeaning`.",
        "The verse detail still shows Sanskrit (collapsible), Literal English translation, Gen Z interpretation, and Action Step.",
        "Layout remains responsive and does not leave an empty gap where the Hindi section used to be."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/verse/VerseCard.tsx",
          "operation": "modify",
          "description": "Remove the \"Literal Hindi Translation\" block and any rendering of verse.hindiMeaning. Rebalance the responsive grid so remaining sections (Literal English and Gen Z interpretation) flow naturally without empty gaps (e.g., adjust grid column spans and update any comments/labels that state a 4-part layout). Keep all user-facing text English-only. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}