{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-13T11:29:48.192Z",
  "summary": "Frontend adds a reusable QueryErrorState component and integrates clearer error states + Retry actions into ChapterDetailView, VerseDetailView, and Today’s Wisdom. ChapterListView also adds safer string handling and an error+retry alert. Backend changes are present but truncated in the diff summary, so hardening of specific query methods cannot be verified from the provided evidence.",
  "missing_requirements": [
    {
      "id": "REQ-3",
      "requirement": "Harden backend Read Gita query methods so they cannot trap on missing data and always return the expected types for getAllChapters, getVersesByChapter, getVerse, and getTodaysVerse.",
      "reason": "backend/main.mo is truncated in the diff summary and does not include the implementations of getAllChapters/getVersesByChapter/getVerse/getTodaysVerse, so it cannot be verified that these methods were updated to never trap and to return the required types/behaviors (e.g., getVerse returns null when missing; getTodaysVerse always returns a Verse).",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added/updated React Query hooks unrelated to the Read Gita error-handling requirements (e.g., useGetCuratedVersesByMood, useChatbotResponse).",
      "reason": "BuildRequest only asks for Read Gita reliability fixes and error handling in specific Read Gita views plus backend hardening for Read Gita query methods; mood-curation and chatbot hooks are not part of the requested scope.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/common/QueryErrorState.tsx",
    "frontend/src/components/today/TodaysWisdomCard.tsx",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/ReadGita/ChapterDetailView.tsx",
    "frontend/src/pages/ReadGita/ChapterListView.tsx",
    "frontend/src/pages/ReadGita/VerseDetailView.tsx",
    "project_state.json"
  ]
}